app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'denura.20230235@iit.ac.lk'
---
            return redirect()->back()->withInput()->with('error', 'Password must be at least 8 characters and include uppercase, lowercase and a number.');
        }

        $existingUser = $db->table('users')->where('email', $email)->get()->getRow();

INSERT INTO `users` (`name`, `email`, `role`, `password_hash`, `is_verified`, `created_at`, `updated_at`) VALUES ('denura', 'denura.20230235@iit.ac.lk', 'alumnus', '$2y$12$mwWqx6BBD.4L1C2aCchgRuZwxDxG6lLy.iutDBJefX8zI/hoPuxMC', 0, '2026-04-01 16:52:48', '2026-04-01 16:52:48')
---
        $token = bin2hex(random_bytes(32)); // 64-char hex, cryptographically random
        $now   = date('Y-m-d H:i:s');

        $db->table('users')->insert([
            'name'          => $name,
            'email'         => $email,
            'role'          => $role,
            'password_hash' => password_hash($password, PASSWORD_BCRYPT, ['cost' => 12]),
            'is_verified'   => 0,
            'created_at'    => $now,
            'updated_at'    => $now,
        ]);

INSERT INTO `email_verifications` (`user_id`, `token_hash`, `expires_at`, `created_at`) VALUES (17, 'a78d80f339e2fc06c662968ea6958069eeed5b0a70dc10c3791d46b0fb63af54', '2026-04-02 16:52:48', '2026-04-01 16:52:48')
---
        $userId = $db->insertID();

        // Store SHA-256 hash of token (never store raw tokens)
        $db->table('email_verifications')->insert([
            'user_id'    => $userId,
            'token_hash' => hash('sha256', $token),
            'expires_at' => date('Y-m-d H:i:s', strtotime('+1 day')),
            'created_at' => $now,
        ]);

SELECT *
FROM `email_verifications`
WHERE `token_hash` = 'a78d80f339e2fc06c662968ea6958069eeed5b0a70dc10c3791d46b0fb63af54'
UPDATE `users` SET `is_verified` = 1, `updated_at` = '2026-04-01 16:53:00'
WHERE `id` = '17'
DELETE FROM `email_verifications`
WHERE `id` = '4'
---
    public function verifyEmail()
    {
        $db    = Database::connect();
        $token = trim((string) $this->request->getGet('token'));

        if ($token === '') {
            return redirect()->to('/login')->with('error', 'Invalid verification link.');
        }

        $tokenHash = hash('sha256', $token);
        $record    = $db->table('email_verifications')->where('token_hash', $tokenHash)->get()->getRow();

        if (!$record) {
            return redirect()->to('/login')->with('error', 'Invalid or already-used verification link.');
        }

        if (strtotime($record->expires_at) < time()) {
            // Clean up expired token
            $db->table('email_verifications')->where('id', $record->id)->delete();
            return redirect()->to('/login')->with('error', 'Verification link has expired. Please register again.');
        }

        $db->table('users')->where('id', $record->user_id)->update([
            'is_verified' => 1,
            'updated_at'  => date('Y-m-d H:i:s'),
        ]);

        // Single-use: delete token after successful verification
        $db->table('email_verifications')->where('id', $record->id)->delete();

SELECT *
FROM `users`
WHERE `email` = 'ishani.20230731@iit.ac.lk'
---
    public function loginPost()
    {
        // Rate limit: 5 attempts per 5 minutes per IP
        if (!$this->checkRateLimit('login', 5, 300)) {
            return redirect()->back()->with('error', 'Too many login attempts. Please wait 5 minutes before trying again.');
        }

        $db       = Database::connect();
        $email    = strtolower(trim((string) $this->request->getPost('email')));
        $password = (string) $this->request->getPost('password');

        if ($email === '' || $password === '') {
            return redirect()->back()->withInput()->with('error', 'Email and password are required.');
        }

        $user = $db->table('users')->where('email', $email)->get()->getRowArray();