app/Controllers/BidController.php

    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $userId   = (int) session()->get('user_id');
        $bidModel = new BidModel();
        $today    = date('Y-m-d');

        $myBidToday = $bidModel
            ->where('user_id', $userId)
            ->where('bid_date', $today)
            ->first();

        // Determine win/lose status without revealing the top bid amount (blind bidding)
        $topBid = $bidModel
            ->where('bid_date', $today)
            ->where('is_active', 1)
            ->orderBy('bid_amount', 'DESC')
            ->first();
---
SELECT *
FROM `bids`
WHERE `user_id` = 16
AND `bid_date` = '2026-04-01'
 LIMIT 1
SELECT *
FROM `bids`
WHERE `bid_date` = '2026-04-01'
AND `is_active` = 1
ORDER BY `bid_amount` DESC
 LIMIT 1

        $bidsThisMonth        = $this->bidsThisMonth($userId);
        $allowedWinsThisMonth = $this->allowedWinsThisMonth($userId);

        return view('bids/index', [
            'bids'                 => $bidModel->where('user_id', $userId)->orderBy('id', 'DESC')->findAll(),
            'myBidToday'           => $myBidToday,
            'winningStatus'        => $winningStatus,
            'winsThisMonth'        => $bidsThisMonth,
            'allowedWinsThisMonth' => $allowedWinsThisMonth,
        ]);
---
SELECT *
FROM `bids`
WHERE `user_id` = 16
ORDER BY `id` DESC

    private function winsThisMonth(int $userId): int
    {
        return (new FeaturedWinnerModel())
            ->where('user_id', $userId)
            ->where('feature_date >=', date('Y-m-01'))
            ->where('feature_date <=', date('Y-m-t'))
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `featured_winners`
WHERE `user_id` = 16
AND `feature_date` >= '2026-04-01'
AND `feature_date` <= '2026-04-30'

    private function allowedWinsThisMonth(int $userId): int
    {
        $db    = \Config\Database::connect();
        $extra = 0;

        if ($db->tableExists('alumni_event_participation')) {
            $extra = $db->table('alumni_event_participation')
                ->where('user_id', $userId)
                ->where('event_date >=', date('Y-m-01'))
                ->where('event_date <=', date('Y-m-t'))
                ->countAllResults() > 0 ? 1 : 0;
---
SELECT COUNT(*) AS `numrows`
FROM `alumni_event_participation`
WHERE `user_id` = 16
AND `event_date` >= '2026-04-01'
AND `event_date` <= '2026-04-30'