app/Controllers/Home.php

    public function index()
    {
        $winnerModel = new FeaturedWinnerModel();
        $winner = $winnerModel
            ->select('featured_winners.*, users.name, users.bio, users.linkedin_url, users.job_title_now, users.profile_image')
            ->join('users', 'users.id = featured_winners.user_id', 'left')
            ->where('feature_date', date('Y-m-d'))
            ->first();
---
SELECT `featured_winners`.*, `users`.`name`, `users`.`bio`, `users`.`linkedin_url`, `users`.`job_title_now`, `users`.`profile_image`
FROM `featured_winners`
LEFT JOIN `users` ON `users`.`id` = `featured_winners`.`user_id`
WHERE `feature_date` = '2026-04-01'
 LIMIT 1