app/Controllers/ProfileController.php

    public function index()
    {
        $db     = Database::connect();
        $userId = session()->get('user_id');

        if (!$userId) {
            return redirect()->to('/login');
        }

        $user           = $db->table('users')->where('id', $userId)->get()->getRowArray();
        $certifications = $db->table('certifications')->where('user_id', $userId)->get()->getResultArray();
        $licences       = $db->table('professional_licences')->where('user_id', $userId)->get()->getResultArray();
        $degrees        = $db->table('degrees')->where('user_id', $userId)->get()->getResultArray();
        $shortCourses   = $db->table('short_courses')->where('user_id', $userId)->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `id` = '16'
SELECT *
FROM `certifications`
WHERE `user_id` = '16'
SELECT *
FROM `professional_licences`
WHERE `user_id` = '16'
SELECT *
FROM `degrees`
WHERE `user_id` = '16'
SELECT *
FROM `short_courses`
WHERE `user_id` = '16'

    public function manage()
    {
        $db     = Database::connect();
        $userId = session()->get('user_id');

        if (!$userId) {
            return redirect()->to('/login');
        }

        return view('profile/manage', [
            'user'        => $db->table('users')->where('id', $userId)->get()->getRowArray(),
            'certifications' => $db->table('certifications')->where('user_id', $userId)->get()->getResultArray(),
            'licences'    => $db->table('professional_licences')->where('user_id', $userId)->get()->getResultArray(),
            'degrees'     => $db->table('degrees')->where('user_id', $userId)->get()->getResultArray(),
            'courses'     => $db->table('short_courses')->where('user_id', $userId)->get()->getResultArray(),
            'employment'  => $db->table('employment_history')->where('user_id', $userId)->get()->getResultArray(),
---
SELECT *
FROM `certifications`
WHERE `user_id` = '16'
SELECT *
FROM `professional_licences`
WHERE `user_id` = '16'
SELECT *
FROM `degrees`
WHERE `user_id` = '16'
SELECT *
FROM `short_courses`
WHERE `user_id` = '16'
SELECT *
FROM `employment_history`
WHERE `user_id` = '16'